tap "adoptopenjdk/openjdk"
tap "borkdude/brew"
tap "buildpacks/tap"
tap "clojure-lsp/brew"
tap "cloudflare/cloudflare"
tap "d12frosted/emacs-plus"
tap "graalvm/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "michaeleisel/zld"
tap "microsoft/git"
tap "minio/stable"
tap "teamookla/speedtest"
# Run your GitHub Actions locally 🚀
brew "act"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Improved shell history for zsh and bash
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Dynamic, general-purpose programming language
brew "clojure"
# Clojure to JS compiler
brew "clojurescript"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line tool for DigitalOcean
brew "doctl"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Generic library support script
brew "libtool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Text-based UI library
brew "ncurses"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go cross compile tool
brew "gox"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Multi-platform programming language
brew "haxe"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Cross-platform Java Version Manager
brew "jabba"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Build tool for Clojure
brew "leiningen"
# Next-gen compiler infrastructure
brew "llvm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Package manager for the Lua programming language
brew "luarocks"
# Create modern online books from Markdown files
brew "mdbook"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Optimized BLAS library
brew "openblas"
# Development kit for the Java programming language
brew "openjdk@8"
# OpenShift command-line interface tools
brew "openshift-cli"
# Apache Parquet command-line tools and utilities
brew "parquet-tools"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Draw UML diagrams
brew "plantuml"
# Python version management
brew "pyenv"
# QR Code generation
brew "qrencode"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Version control system designed to be a better CVS
brew "subversion"
# Temporal CLI (tctl)
brew "tctl"
# CLI for interacting with TektonCD
brew "tektoncd-cli"
# Official documentation format of the GNU project
brew "texinfo"
# Terminal multiplexer
brew "tmux"
# Modern reverse proxy
brew "traefik"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Native, fast starting Clojure interpreter for scripting.
brew "borkdude/brew/babashka"
# A minimal and opinionated linter for Clojure code that sparks joy.
brew "borkdude/brew/clj-kondo"
# Transform JSON into EDN into Transit.
brew "borkdude/brew/jet"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# Language Server (LSP) for Clojure
brew "clojure-lsp/brew/clojure-lsp-native"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
brew "d12frosted/emacs-plus/emacs-plus@27"
# A faster version of ld, Apple's linker
brew "michaeleisel/zld/zld"
# High Performance Object Storage compatible with Amazon S3 API
brew "minio/stable/minio"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# GPU-accelerated terminal emulator
cask "alacritty"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Bluetooth Low Energy browser
cask "bluetility"
# Web browser focusing on privacy
cask "brave-browser"
# Macbook | Clock, right on the touch bar
cask "clock-bar"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Matrix collaboration client
cask "element"
# Programming language
cask "factor"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Screen color temperature controller
cask "flux"
cask "font-fira-code"
cask "font-firacode-nerd-font"
cask "font-saucecodepro-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "git-credential-manager-core"
# Web browser
cask "google-chrome"
cask "graalvm-ce-java11"
cask "graalvm-ce-lts-java8"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customizer
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# Display key code, unicode value and modifier keys state for any key combination
cask "key-codes"
# GPU-based terminal emulator
cask "kitty"
# Quickly mute your microphone with a global shortcut or menu bar control
cask "mic-drop"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Utility to move and zoom windows—on one display
cask "moom"
# Audiobook manager for Audible users
cask "openaudible"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# File sync and share software
cask "resilio-sync"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# API testing tool
cask "soapui"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Automatic time-tracking application
cask "timemator"
# Time tracker
cask "toggl-track"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
